"+ Add" = "+ Toevoegen";

"Add a card" = "Een kaart toevoegen";

"Add a payment method" = "Een betaalmethode toevoegen";

"Add bank account" = "Bankrekening toevoegen";

"Add new payment method" = "Nieuwe betaalmethode toevoegen";

"Add your payment information" = "Je betaalgegevens toevoegen";

"Approve payment" = "Betaling goedkeuren";

"Back" = "Terug";

"Bank account" = "Bankrekening";

"Buy now or pay later with Klarna." = "Koop nu of betaal later met Klarna.";

"Buy using a UPI ID" = "Kopen met een UPI-ID";

"By confirming your payment with PayPal, you allow %@ to charge your PayPal account for future payments in accordance with their terms." = "Als je je betaling met PayPal bevestigt, geef je %@ toestemming om toekomstige betalingen in rekening te brengen op je PayPal-account in overeenstemming met hun voorwaarden.";

"By continuing to PayPal, you allow %@ to charge your PayPal account for future payments in accordance with their terms." = "Als je doorgaat naar PayPal, geef je %@ toestemming om toekomstige betalingen in rekening te brengen op je PayPal-account in overeenstemming met hun voorwaarden.";

"By continuing to Revolut Pay, you allow %@ to charge your Revolut Pay account for future payments in accordance with their terms." = "Als je doorgaat naar Revolut Pay, geef je %@ toestemming om toekomstige betalingen in rekening te brengen op je Revolut Pay-account in overeenstemming met hun voorwaarden.";

"By continuing, you agree to authorize payments pursuant to <terms>these terms</terms>." = "Als je doorgaat, ga je ermee akkoord betalingen in overeenstemming met <terms>deze voorwaarden</terms> te autoriseren.";

"By continuing, you authorize %@ to debit your Cash App account for this payment and future payments in accordance with %@'s terms, until this authorization is revoked. You can change this anytime in your Cash App Settings." = "Als je doorgaat, geef je %1$@ toestemming om deze betaling en toekomstige betalingen in rekening te brengen op je Cash App-account, in overeenstemming met de voorwaarden van %2$@, totdat je deze toestemming intrekt. Je kunt dit op elk moment wijzigen via je Cash App-instellingen.";

"By joining Link, you agree to the <terms>Terms</terms> and <privacy>Privacy Policy</privacy>." = "Door Link te gebruiken ga je akkoord met de <terms>voorwaarden</terms> en het <privacy>privacybeleid</privacy>.";

"By providing your payment information and confirming this payment, you authorise (A) %@ and Stripe, our payment service provider, to send instructions to your bank to debit your account and (B) your bank to debit your account in accordance with those instructions. As part of your rights, you are entitled to a refund from your bank under the terms and conditions of your agreement with your bank. A refund must be claimed within 8 weeks starting from the date on which your account was debited. Your rights are explained in a statement that you can obtain from your bank. You agree to receive notifications for future debits up to 2 days before they occur." = "Door je betaalgegevens op te geven en deze betaling te bevestigen geef je toestemming aan (A) %@ en Stripe, onze betaaldienstverlener, een opdracht te sturen aan je bank om je rekening te debiteren en aan (B) je bank om je rekening te debiteren conform deze opdracht. Je hebt het recht op terugbetaling door je bank conform de met je bank overeengekomen voorwaarden. Een verzoek tot terugbetaling moet worden ingediend binnen 8 weken vanaf de datum waarop je rekening is gedebiteerd. Je rechten worden uitgelegd in een verklaring die je kunt opvragen bij je bank. Je stemt ermee in dat je minstens 2 dagen voor de uitvoering van toekomstige debiteringen hierover op de hoogte wordt gesteld.";

"By saving your bank account for %@ you agree to authorize payments pursuant to <terms>these terms</terms>." = "Als je je bankrekening voor %@ opslaat, ga je ermee akkoord betalingen in overeenstemming met <terms>deze voorwaarden</terms> te autoriseren.";

"CPF/CPNJ" = "CPF/CPNJ";

"Cancel and pay another way" = "Annuleren en op een andere manier betalen";

"Choose a payment method" = "Een betaalmethode kiezen";

"Close card scanner" = "Kaartscanner afsluiten";

"Confirm" = "Bevestigen";

"Confirm the payment in your bank or payment app within %@ to complete the purchase." = "Bevestig de betaling via je bank of betaal-app binnen %@ om de aankoop af te ronden.";

"Confirm the payment in your bank's app within %@ to complete the purchase." = "Bevestig de betaling in de app van je bank binnen %@ om de aankoop af te ronden.";

"Contact information" = "Contactgegevens";

"EPS Bank" = "EPS Bank";

"Enter address manually" = "Adres handmatig invoeren";

"FPX Bank" = "FPX Bank";

"IBAN" = "IBAN";

"Manage your payment methods" = "Uw betaalmethoden beheren";

"Name on card" = "Naam op betaalkaart";

"Open your UPI app to approve your payment within %@" = "Open de UPI-app om je betaling goed te keuren binnen %@";

"Or" = "Of";

"Or pay using" = "Of betalen met";

"Or pay with a card" = "Of met een kaart betalen";

"Pay %@" = "%@ betalen";

"Pay another way" = "Betalen op een andere manier";

"Pay faster at %@ and thousands of merchants." = "Reken sneller af bij %@ en duizenden andere handelaren.";

"Pay in <num_installments/> interest-free payments of <installment_price/> with <img/>" = "Betaal in <num_installments/> rentevrije termijnen van <installment_price/> met <img/>";

"Pay later with Klarna." = "Betaal later met Klarna.";

"Pay over time with %@" = "Betalen in termijnen met %@";

"Pay with Link" = "Betalen met Link";

"Pay with your bank account in just a few steps." = "Betaal in een paar stappen met je bankrekening.";

"Payment failed" = "Betaling is mislukt";

"Please go back and select another payment method" = "Ga terug en selecteer een andere betaalmethode.";

"Point the camera at your card." = "Richt de camera op de kaart.";

"Processing..." = "Verwerken...";

"Przelewy24 Bank" = "Przelewy24 Bank";

"Remove %1$@ ending in %2$@" = "%1$@ eindigend op %2$@ verwijderen";

"Remove Card" = "Kaart verwijderen";

"Save" = "Opslaan";

"Save a new payment method" = "Een nieuwe betaalmethode opslaan";

"Save address" = "Adres opslaan";

"Save for future payments" = "Opslaan voor toekomstige betalingen";

"Save my info for secure 1-click checkout" = "Bewaar mijn gegevens om veilig in één klik te kunnen afrekenen";

"Save this account for future %@ payments" = "Dit account opslaan voor toekomstige betalingen bij %@";

"Save this card for future %@ payments" = "Deze kaart opslaan voor toekomstige aankopen bij %@";

"Save your bank account in just a few steps." = "Sla je bankrekening in een paar stappen op.";

"Select your payment method" = "Betaalmethode selecteren";

"Set up" = "Instellen";

"Shipping to %@ is not supported." = "Verzending naar %@ wordt niet ondersteund.";

"Show menu" = "Menu weergeven";

"Stripe will deposit $0.01 to your account in 1-2 business days. Then you'll get an email with instructions to finish saving your bank account with %@." = "Binnen 1 à 2 werkdagen stort Stripe $ 0,01 op je rekening. Daarna krijg je een e-mail met instructies om het instellen van je bankrekening bij %@ te voltooien.";

"Stripe will deposit $0.01 to your account in 1-2 business days. Then you’ll get an email with instructions to complete payment to %@." = "Binnen 1-2 werkdagen stort Stripe $ 0,01 op je rekening. Daarna krijg je een e-mail met instructies over hoe je de betaling aan %@ kunt voltooien.";

"The IBAN you entered is incomplete." = "Het opgegeven IBAN-nummer is onvolledig.";

"Update card" = "Betaalkaart bijwerken";

"Your IBAN should start with a two-letter country code." = "Het IBAN-nummer moet beginnen met een landcode van twee letters.";

"iDEAL Bank" = "iDEAL-bank";
